testCase250umXCTSmoothing/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    maxX
    {
        type            fixedValue;
        value           uniform 0;
    }
    minY
    {
        type            symmetryPlane;
    }
    maxY
    {
        type            symmetryPlane;
    }
    minZ
    {
        type            symmetryPlane;
    }
    maxZ
    {
        type            symmetryPlane;
    }
    PorousMedia
    {
        type            zeroGradient;
    }
    minX
    {
        type            zeroGradient;
    }
    maxX0
    {
        type            fixedValue;
        value           uniform 0;
    }
    minX0
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
